"""
დაწერეთ პროგრამა რომელიც მიიღებს დადებით მთელ რიცხვს - n. 0 < n <= 1000.
პროგრამამ უნდა დაბეჭდოს რიცხვების მიმდევრობა რომელიც მიიღება შემდეგი პირობით:
თუ რიცხვი ლუწია, ეს რიცხვი უნდა გავყოთ 2-ზე, ხოლო თუ რიცხვი კენტია
ეს რიცხვი უნდა გავამრავლოთ 3-ზე და დავუმატოთ 1, იქამდე სანამ არ მივიღებთ 1-ს.
"""

user_num = int(input("შეიყვანეთ რიცხვი 0-დან 1000-მდე: "))

while user_num > 1:
    if user_num % 2 == 0:
        user_num = user_num / 2
        print(int(user_num), end=" ")
    else:
        user_num = user_num * 3 + 1
        print(int(user_num), end=" ")
