"""
დაწერეთ პროგრამა რომელიც მიიღებს ნატურალურ რიცხვს n. n > 1.
პროგრამამ უნდა დააგენერიროს n ცალი წყვილი შემთხვევითი რიცხვი a,b, სადაც 0<a<1 და 0<b<1.
Შემოიღეთ მთვლელი counter, თუ დაგენერირებული რიცხვი აკმაყოფილებს პირობას
math.sqrt(a ** 2 + b ** 2) <=1, counter-ის მნიშვნელობა გაზარდეთ 1-ით.
ეკრანზე დაბეჭდეთ 4 * counter / n.
გაუშვით პროგრამა და გადაეცით შემდეგი მნიშვნელობები: 10, 100, 100000, 10000000. Რას ამჩნევთ?
"""
from random import uniform
from math import sqrt

n = int(input("შეიყვანეთ ნატურალური რიცხვი: "))

if n > 1:
    counter = 0
    for _ in range(n):
        a = uniform(0, 1)
        b = uniform(0, 1)
        if sqrt(a ** 2 + b ** 2) <= 1:
            counter += 1
    result = 4 * counter / n

print(result)
