"""
2. (8 ქულა) Დაწერეთ პროგრამა რომელიც მოხმარებელს მოსთხოვს შეიყვანოს მთელი რიცხვი n,
სადაც 10 <= n <= 5432. Თუ მომხმარებელი შეიყვანს არასწორ რიცხვს ეკრანზე დაბეჭდეთ
რომ პროგრამას გადმოეცა არასწორი რიცხვი და შეწყვიტეთ პროგრამის მუშაობა.
Თუ მომხმარებელი შეიყვანს სწორ რიცხვს, პროგრამამ უნდა იპოვოს ყველა 13 ის ჯერადი რიცხვი 1-დან n-მდე.
Ეკრანზე დაბეჭდოს ეს რიცხვები და მათი საერთო რაოდენობა.
"""

user_num = int(input("შეიყვანეთ მთელი რიცხვი 10-დან 5432-მდე: "))
counter = 0

if 10 <= user_num <= 5432:
    print(f" 10-დან {user_num}-მდე ნაპოვნი 13-ის ჯერადი რიცხვებია: ", end=" ")
    for num in range (10, user_num+1):
        if num % 13 == 0:
            counter += 1
            print(num, end=" ")
    print(f"სულ ნაპოვნია {counter} რიცხვი")    
        
else:
    print("პროგრამას გადაეცა არასწორი რიცხვი")
    exit(1)