"""
დაწერეთ პროგრამა რომელიც არგუმენტად მიიღებს მანქანის სიჩქარეს, განსაზღვრავს მისი სიჩქარის კატეგორიას და დაბეჭდავს ეკრანზე.
სიჩქარის კატეგორიები განისაზღვრება შემდეგნაირად.
თუ ავტომობილის სიჩქარე 30 კმ/სთ-ზე ნაკლებია, მისი კატეგორიაა - SLOW.
როცა ავტომობილის სიჩქარე 120 კმ/სთ-ზე მეტია, მისი კატეგორიაა - VERY FAST.
თუ ავტომობილის სიჩქარე მეტია 60 კმ/სთ-ზე, მისი კატეგორიაა - FAST.
ხოლო თუავტომობილის სიჩქარე მეტია 30 კმ/სთ-ზე, მისი კატეგორიაა - MODERATE.
(თუ ავტომობლი ხვდება ორ კატეგორაიში, უნდა შეირჩეს უფრო სწრაფი კატეგორია)
"""
car_speed = int(input("შეიყვანეთ ავტომობილის სიჩქარე: "))

if car_speed > 0:
    if car_speed <= 30:
        print("კატეგორია - SLOW")
    elif car_speed <= 60:
        print("კატეგორია: MODERATE")
    elif car_speed <= 120:
        print("კატეგორია: FAST")
    else:
        print("კატეგორია: VERY FAST")
else:
    print("აღნიშნული რიცხვი არ არის დაშვებული")
    exit